/*
Рівень В). Сформувати масив структур з об’єднаннями, що містять інформацію
про: прізвище студента, курс, спеціальність (для представлення спеціальності
використовувати переліки, а для представлення курсу – цілі числа) та оцінки з
фізики, математики; якщо спеціальність – «Комп’ютерні науки», то третя оцінка –
з програмування; якщо спеціальність – «Інформатика», то третя оцінка – з
чисельних методів; для всіх інших спеціальностей: «Математика та економіка»,
«Фізика та інформатика», «Трудове навчання» – третя оцінка – з педагогіки. Для
представлення третьої оцінки використовувати об’єднання
*/

/*
Рівень В) – дев’ять клітинок: (1) – порядковий номер студента у групі, (2) –
прізвище, (3) – курс, (4) – спеціальність, оцінки з (5) – фізики, (6) –
математики (клітинки цих оцінок заповнені для студентів всіх спеціальностей),
оцінки з (7) – програмування, (8) – чисельних методів, (9) – педагогіки
(заповнена лише одна з клітинок цих оцінок – залежно від спеціальності такого
студента).
*/

/*
Варіант 14.
1. Програма має дати користувачеві можливість фізично впорядкувати масив в першу
чергу – за значенням оцінки з третього – профільного – предмету, в другу чергу
(для однакових оцінок з третього предмету) – за номером курсу, в останню чергу
(для однакових оцінок з третього предмету і курсів) – за прізвищем за спаданням
– в зворотному до алфавітного порядку.
2. Програма має будувати індексний масив, який забезпечує таке індексне
впорядкування: в першу чергу – за значенням оцінки з третього – профільного –
предмету, в другу чергу (для однакових оцінок з третього предмету) – за номером
курсу, в останню чергу (для однакових оцінок з третього предмету і курсів) – за
прізвищем.
*/

#include "lab102bstud.h"
#include <iostream>
using namespace std;

int main() {
  vector<Student> s = {
      {1, "Lunga", 1, CS, 5, 5, {.programming = 5}},
      {2, "Kuzma", 2, PI, 5, 4, {.pedagogy = 3}},
      {3, "Petrenko", 3, CS, 4, 4, {.programming = 4}},
      {4, "Sidorov", 4, TN, 3, 5, {.pedagogy = 4}},
      {5, "Ivanov", 5, INF, 4, 3, {.numerical = 5}},
      {6, "Smirnov", 2, CS, 5, 5, {.programming = 5}},
      {7, "Kovalenko", 3, ME, 3, 4, {.pedagogy = 3}},
  };

  printTable(s);
  sortPhysical(s);
  printTable(s);

  auto idx = buildIndexArray(s);
  printIndexTable(s, idx);

  int pos = binarySearch(s, "Petrenko", 3, 4);
  if (pos != -1)
    cout << "Found at: " << pos << endl;
  else
    cout << "Not found\n";

  return 0;
}
